{
  "ibmIntern": {
    "title": "Daeja ViewONE Virtual",
    "description": "Working as a developer here I have been a part of an agile development cycle. Developing in a variety of languages from XML to Java. Whilst working in the Daeja team I have worked on many different projects, furthering my knowledge of automated testing with technologies (Vagrant, Selenium, REST tests). As well as working in a complex and large codebase that has been maintained for a long time.",
    "subtitle": "Early Professionals Hub",
    "subdescription": "Whilst at IBM I worked on a giveback team of interns on the EPH (Early Professionals Hub).A web-based project written in React using a variety of web based libraries such as Redux. The site interacts with a cloud based database (IBM Cloudant) to maintain information on its users and various data tracking.",
    "image": "ibm.png"
  },
  "universityOfHertfordshire": {
    "title": "Computer Science (Software Engineering) (2016-2020)",
    "description": "I have grown a lot throughout my time at university, achieving a First Class with Honours averaging an 84% across my modules. Notable module grades include Software Engineering Practice (94%), Mobile Computing (85%) and Software Engineering Project (84%). Furthermore, I have interacted with many extra-curricular activities such as working on the Esports Society and being a voting member on the Student Council.",
    "subtitle": "Projects and Experiences",
    "subdescription": "At university, I was given the opportunity to work on a variety of different projects to expand my skillset. In Mobile Computing I learned all about developing on Apple products, learning Swift to make a small iOS game. In Software Engineering Practice and Object-Oriented Programming I furthered my skills and understanding of object-oriented programming in Java.",
    "image": "uh.png"
  },
  "hertsgg": {
    "title": "Chair for Esports Society (2019-2020)",
    "description": "I am responsible for managing the committee and ensuring the society continues to thrive as one of the premier esports societies in the country. Including maintaining and holding talks with our associated sponsors including Overclockers UK and ASUS ROG.",
    "subtitle": "Treasurer for Esports Society (2017-2019)",
    "subdescription": "I am responsible for the outgoing transactions and understand the financing of the society. This role further included communicating effectively with a range of other volunteers in the society and to deal with a variety of customers who join the society.",
    "image": "hertsgg.png"
  },
  "housesbot": {
    "title": "Herts Esports Society Discord Bot",
    "description": "This bot is written in Node.js implementing Discord API and is used for within the Herts Esports Society's Official Discord Server for a variety of purposes. Implementing Twitch API and using MongoDB as a database service, I have written this bot to be able to track stats of the twitch streamers within the society.",
    "subtitle": "Additional Use Cases",
    "subdescription": "The bot also has a lot of other purposes for the admin side of the society, for things such as purging specific roles, shuffling 'houses', verifying members and more. There is a list of these commands in my GitHub repository. This is a very adaptable that can be changed depending on the societies needs.",
    "image": "discordbot.png"
  }
}
